pycom/pycom-micropython-sigfox/esp32/sigfox/modsigfox.c
static int32_t sigfox_recv (byte *buf, uint32_t len, int32_t timeout_ms) {
    sigfox_rx_data_t rx_data;

    if (timeout_ms < 0) {
        // blocking mode
        timeout_ms = portMAX_DELAY;
    }

    // if there's a partial packet pending
    if (sigfox_partial_rx_packet.size > 0) {
        // adjust the len
        uint32_t available_len = sigfox_partial_rx_packet.size - sigfox_partial_rx_packet.index;
        if (available_len < len) {
            len = available_len;
        }

        // get the available data
        memcpy(buf, &sigfox_partial_rx_packet.data[sigfox_partial_rx_packet.index], len);

        // update the index and size values
        sigfox_partial_rx_packet.index += len;
        if (sigfox_partial_rx_packet.index == sigfox_partial_rx_packet.size) {
            // there's no more data left
            sigfox_partial_rx_packet.size = 0;
        }
        // return the number of bytes received
        return len;
    } else if (xQueueReceive(xRxQueue, &rx_data, (TickType_t)(timeout_ms / portTICK_PERIOD_MS))) {
        // adjust the len
        if (rx_data.len < len) {
            len = rx_data.len;
        }

        // get the available data
        memcpy(buf, rx_data.data, len);

        // copy the remainder to the partial data buffer
        int32_t r_len = rx_data.len - len;
        if (r_len > 0) {
            memcpy(sigfox_partial_rx_packet.data, &rx_data.data[len], r_len);
            sigfox_partial_rx_packet.size = r_len;
            sigfox_partial_rx_packet.index = 0;
        }
        // return the number of bytes received
        return len;
    }
    // non-blocking sockects do not thrown timeout error
    if (timeout_ms == 0) {
        return 0;
    }
    // there's no data available
    return -1;
}

static bool sigfox_rx_any (void) {
    sigfox_rx_data_t rx_data;
    if (sigfox_partial_rx_packet.size > 0) {
        return true;
    } else if (xQueuePeek(xRxQueue, &rx_data, (TickType_t)0)) {
        return true;
    }
    return false;
}

static bool sigfox_tx_space (void) {
    if (uxQueueSpacesAvailable(xCmdQueue) > 0) {
        return true;
    }
    return false;
}

static void sigfox_validate_frequency (uint32_t frequency) {
    if (frequency < FSK_FREQUENCY_MIN || frequency > FSK_FREQUENCY_MAX) {
        nlr_raise(mp_obj_new_exception_msg_varg(&mp_type_ValueError, "frequency %d out of range", frequency));
    }
}

/******************************************************************************/
// Micro Python bindings; Sigfox class

mp_obj_t sigfox_init_helper(sigfox_obj_t *self, const mp_arg_val_t *args) {
    sigfox_cmd_rx_data_t cmd_rx_data;
    uint8_t mode = args[0].u_int;
    uint8_t rcz = args[1].u_int;
    uint32_t frequency = 0;

    if (mode > E_SIGFOX_MODE_FSK) {
        mp_raise_ValueError("invalid mode");
    } else if (mode == E_SIGFOX_MODE_SIGFOX) {
        if (rcz > E_SIGFOX_RCZ4) {
            mp_raise_ValueError("invalid RCZ");
        } else if (args[2].u_obj != mp_const_none) {
            mp_raise_ValueError("frequency is only valid in FSK mode");
        }
    } else {
        frequency = mp_obj_get_int(args[2].u_obj);
        sigfox_validate_frequency(frequency);
    }

    cmd_rx_data.cmd_u.cmd = E_SIGFOX_CMD_INIT;
    cmd_rx_data.cmd_u.info.init.frequency = frequency;
    cmd_rx_data.cmd_u.info.init.mode = mode;
    cmd_rx_data.cmd_u.info.init.rcz = rcz;
    sigfox_send_cmd (&cmd_rx_data);
    self->state = E_SIGFOX_STATE_IDLE;

    return mp_const_none;
}

mp_obj_t sigfox_mac(mp_obj_t self_in) {
    uint8_t mac[8];
    config_get_lpwan_mac(mac);
    return mp_obj_new_bytes((const byte *)mac, sizeof(mac));
}

mp_obj_t sigfox_id(mp_obj_t self_in) {
    uint8_t id[4];
    config_get_sigfox_id(id);
    return mp_obj_new_bytes((const byte *)id, sizeof(id));
}

mp_obj_t sigfox_pac(mp_obj_t self_in) {
    uint8_t pac[8];
    config_get_sigfox_pac(pac);
    return mp_obj_new_bytes((const byte *)pac, sizeof(pac));
}

mp_obj_t sigfox_test_mode(mp_obj_t self_in, mp_obj_t mode, mp_obj_t config) {
    sigfox_cmd_rx_data_t cmd_rx_data;
    uint32_t _mode = mp_obj_get_int(mode);
    uint32_t _config = mp_obj_get_int(config);

    if (_mode > SFX_TEST_MODE_TX_SYNTH && _mode != E_MODSIGOFX_TEST_MODE_MANUAL_TX) {
        mp_raise_ValueError("invalid test mode");
    }

    cmd_rx_data.cmd_u.cmd = E_SIGFOX_CMD_TEST;
    cmd_rx_data.cmd_u.info.test.mode = _mode;
    cmd_rx_data.cmd_u.info.test.config = _config;
    sigfox_send_cmd (&cmd_rx_data);
    return mp_const_none;
}

mp_obj_t sigfox_cw(mp_obj_t self_in, mp_obj_t frequency, mp_obj_t start) {
    sigfox_cmd_rx_data_t cmd_rx_data;
    uint32_t _frequency = mp_obj_get_int(frequency);

    if (mp_obj_is_true(start)) {
        cmd_rx_data.cmd_u.info.test.mode = E_MODSIGOFX_TEST_MODE_START_CW;
    } else {
        cmd_rx_data.cmd_u.info.test.mode = E_MODSIGOFX_TEST_MODE_STOP_CW;
    }

    cmd_rx_data.cmd_u.cmd = E_SIGFOX_CMD_TEST;
    cmd_rx_data.cmd_u.info.test.config = _frequency;
    sigfox_send_cmd (&cmd_rx_data);
    return mp_const_none;
}

mp_obj_t sigfox_frequencies(mp_obj_t self_in) {
    mp_obj_t tuple[2];
    tuple[0] = mp_obj_new_int(rcz_frequencies[sfx_rcz_id][0]);
    tuple[1] = mp_obj_new_int(rcz_frequencies[sfx_rcz_id][1]);

    return mp_obj_new_tuple(2, tuple);
}

mp_obj_t sigfox_config(mp_uint_t n_args, const mp_obj_t *args) {
    if (n_args == 1) {
        if (sfx_rcz_id > 0) {
            mp_obj_t tuple[4];
            tuple[0] = mp_obj_new_int_from_uint(rcz_current_config_words[0]);
            tuple[1] = mp_obj_new_int_from_uint(rcz_current_config_words[1]);
            tuple[2] = mp_obj_new_int_from_uint(rcz_current_config_words[2]);
            tuple[3] = mp_obj_new_int_from_uint(rcz_current_channel);
            return mp_obj_new_tuple(4, tuple);
        } else {
            return mp_const_none;
        }
    } else {
        if (sfx_rcz_id > 0) {
            mp_obj_t *config;
            mp_obj_get_array_fixed_n(args[1], 4, &config);
            sfx_u32 config_words[3];
            config_words[0] = mp_obj_get_int_truncated(config[0]);
            config_words[1] = mp_obj_get_int_truncated(config[1]);
            config_words[2] = mp_obj_get_int_truncated(config[2]);
            sfx_u16 channel = mp_obj_get_int_truncated(config[3]);
            if (SFX_ERR_NONE != SIGFOX_API_set_std_config(config_words, channel)) {
                nlr_raise(mp_obj_new_exception_msg(&mp_type_OSError, mpexception_os_operation_failed));
            } else {
                memcpy(rcz_current_config_words, config_words, sizeof(rcz_current_config_words));
                rcz_current_channel = channel;
            }
            return mp_const_none;
        } else {
            nlr_raise(mp_obj_new_exception_msg(&mp_type_OSError,"configuration not possible for RCZ1"));
        }
    }
}

