pycom/pycom-micropython-sigfox/esp32/sigfox/modsigfox.c
int sigfox_socket_recv (mod_network_socket_obj_t *s, byte *buf, mp_uint_t len, int *_errno) {
    SIGFOX_CHECK_SOCKET(s);
    int ret = sigfox_recv (buf, len, s->sock_base.timeout);
    if (ret < 0) {
        *_errno = MP_EAGAIN;
        return -1;
    }
    return ret;
}

int sigfox_socket_setsockopt(mod_network_socket_obj_t *s, mp_uint_t level, mp_uint_t opt, const void *optval, mp_uint_t optlen, int *_errno) {
    SIGFOX_CHECK_SOCKET(s);
    if (level != SOL_SIGFOX) {
        *_errno = MP_EOPNOTSUPP;
        return -1;
    }

    if (opt == SO_SIGFOX_RX) {
        SIGFOX_SOCKET_SET_RX(s->sock_base.sd, *(uint8_t *)optval);
    } else if (opt == SO_SIGFOX_TX_REPEAT) {
        uint8_t tx_repeat = *(uint8_t *)optval;
        if (tx_repeat > 2) {
            *_errno = MP_EOPNOTSUPP;
            return -1;
        }
        SIGFOX_SOCKET_SET_TX_REPEAT(s->sock_base.sd, tx_repeat);
    } else if (opt == SO_SIGFOX_OOB) {
        SIGFOX_SOCKET_SET_OOB(s->sock_base.sd, *(uint8_t *)optval);
    } else if (opt == SO_SIGFOX_BIT) {
        SIGFOX_SOCKET_SET_BIT(s->sock_base.sd, *(uint8_t *)optval);
    } else {
        *_errno = MP_EOPNOTSUPP;
        return -1;
    }
    return 0;
}

int sigfox_socket_settimeout (mod_network_socket_obj_t *s, mp_int_t timeout_ms, int *_errno) {
    SIGFOX_CHECK_SOCKET(s);
    s->sock_base.timeout = timeout_ms;
    return 0;
}

int sigfox_socket_ioctl (mod_network_socket_obj_t *s, mp_uint_t request, mp_uint_t arg, int *_errno) {
    mp_int_t ret = 0;

    SIGFOX_CHECK_SOCKET(s);
    if (request == MP_IOCTL_POLL) {
        mp_uint_t flags = arg;
        if ((flags & MP_IOCTL_POLL_RD) && sigfox_rx_any()) {
            ret |= MP_IOCTL_POLL_RD;
        }
        if ((flags & MP_IOCTL_POLL_WR) && sigfox_tx_space()) {
            ret |= MP_IOCTL_POLL_WR;
        }
    } else {
        *_errno = MP_EINVAL;
        ret = MP_STREAM_ERROR;
    }
    return ret;
}
